app/controllers/attendances_controller.rb

  def index
    @attendances = Attendance.all
---
SELECT "attendances".* FROM "attendances"