app/controllers/events_controller.rb

  def create
    @event = Event.new(event_params)

    respond_to do |format|
      if @event.save
---
INSERT INTO "events" ("title", "description", "start_date", "duration", "price", "user_id", "created_at", "updated_at", "location") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?) RETURNING "id"

  def destroy
    @event.destroy!
---
DELETE FROM "events" WHERE "events"."id" = ?  [["id", 1]]