app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 11], ["LIMIT", 1]]
---
  def show()
    unless user_signed_in?
        id = params[:id]
        @user = User.find(id)

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 11], ["LIMIT", 1]]
---
    def set_user
      @user = User.find(params[:id]) unless params[:id] == 'sign_out'